<!DOCTYPE html>
<html>
<head>
	<title>Segundo Parcial</title>
	<link rel="stylesheet" type="text/css" href="cascadaMG.css">
</head>
<body>
	<table width="100%" border="1">
		<tr>
			<td width="15%"></td>
			<td width="70%">
				<h2>Segundo Parcial</h2>
				<br>
				<a href="Inicio.html"><h3 align="right">Regresar</h3></a>
				<br>
			</td>
			<td width="15%"></td>
		</tr>

		<tr>
			<td width="15%"></td>
			<td width="70%">
				<header class="other">
					<h3>Importancia del prototipado</h3>
				</header>
				<p>
				El prototipo te ayuda a que tu futuro proyecto, herramienta o idea sea lo m&aacute;s perfecto y a prueba de errores desde el inicio.<br>

				Ejemplos de aplicaciones para prototipeo:
				<ol>
					<li>
						<h4>PopApp</h4><br>
						Para IOS, Android y Windows phone. Es una de las herramientas m&aacute;s funcionales. Es una aplicaci&oacute;n que permite usar la c&aacute;mara del m&oacute;vil para fotografiar tus bocetos en papel, y dotarlos de interacci&oacute;n para navegar entre las diferentes pantallas. 
					</li>

					<li>
						<h4>Marvel</h4><br>
							Para iOS y Android. Una nueva herramienta, de mucha utilidad para crear prototipos funcionales de tus aplicaciones a partir del dise&ntilde;o de tus wireframes, o bocetos. 
					</li>

					<li>
						<h4>Adobe XD</h4><br>
							Con Adobe XD, disfrutar&aacute;s de una &uacute;nica y poderosa herramienta para todo el proceso de dise&ntilde;o de experiencias e interfaces de usuario. Podr&aacute;s crear flujos de usuario, diagramas funcionales, dise&ntilde;os de alta fidelidad, prototipos interactivos, animaciones y mucho m&aacute;s sin necesidad de cambiar de una aplicaci&oacute;n a otra o de preocuparte de mantener sincronizados los diseños. 
					</li>
				</ol>
				</p>
			</td>
			<td width="15%"></td>
		</tr>

		<tr>
			<td width="15%"></td>
			<td width="70%">
				<header><h3>Teoria de la Programacion Orientada a Objetos</h3></header>
				<p>
					Existen cuatro conceptos fundamentales dentro de la Programaci&oacute;n Orientada a Objetos que se relacionan entre s&iacute; y que nos permitir&aacute;n tener las riendas de nuestro c&oacute;digo:<br><br>

					<b>Abstracci&oacute;n:</b> proceso mental de extracci&oacute;n de las caracter&iacute;sticas esenciales de algo, ignorando los detalles superfluos.<br>

					<b>Encapsulaci&oacute;n:</b> proceso por el que se ocultan los detalles del soporte de las caracter&iacute;sticas esenciales de una abstracci&oacute;n.<br>

					<b>Modularizaci&oacute;n:</b> proceso de descomposici&oacute;n de un sistema en un conjunto de m&oacute;dulos o piezas independientes y cohesivos (con significado propio). Lo adecuado es conseguir los m&iacute;nimos acoplamientos.<br>

					<b>Jerarquizaci&oacute;n:</b> proceso de estructuraci&oacute;n por el que se produce una organizaci&oacute;n (jerarqu&iacute;a) de un conjunto de elementos en grados o niveles de responsabilidad, incumbencia o composici&oacute;n entre otros.<br><br>

					Si entiendes esos cuatro conceptos entender&aacute;s el por qu&eacute; de la programaci&oacute;n orientada a objetos y, consecuentemente, ser&aacute;s un mejor programador.
				</p>
			</td>
			<td width="15%"></td>
		</tr>

		<tr>
			<td width="15%"></td>
			<td width="70%">
				<h4 align="right"><a href="GaleriaSP.html">Ver galeria</a></h4>
			</td>
			<td width="15%"></td>
		</tr>

		<tr>
			<td colspan="3">
			<footer>
				<table width="100%">
					<tr>
						<td width="33%" align="center">Culiacan, Sinaloa, México</td>
						<td width="33%" align="center">Miercoles 19 de Agosto del 2020</td>
						<td width="33%" align="center">Escrito por: Carlos Humberto Quevedo Beng</td>
					</tr>
				</table>
     		</footer>
     		</td>	
		</tr>
	</table>
</body>
</html>